rottenpotatoes/app/controllers/movies_controller.rb

  def director
    @movie = Movie.find_by(title: params[:title])
    @director_movies = Movie.director_movies(params[:title])
    @director_movies.delete(@movie.title)
    if @director_movies.nil? || @director_movies.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
SELECT "movies"."title" FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]